app/Controllers/AccountController.php

        // Get the current user ID

        // Join the user table with the user_profiles table based on the user ID
        $data['user'] = $userModel->select('users.*, user_profiles.profile_picture')
                                ->join('user_profiles', 'user_profiles.user_id = users.id')
                                ->where('users.id', $currentUserId)
                                ->first();
---
SELECT `users`.*, `user_profiles`.`profile_picture`
FROM `users`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `users`.`id`
WHERE `users`.`id` = '4'
 LIMIT 1