app/Controllers/AccountController.php

    public function Profile(){
        $session = session();
        $userModel = new UserModel();
        $UserProfilesModel = new UserProfilesModel();
        $currentUserId = $session->get("id");

        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }
        $db = \Config\Database::connect();
        $builder = $db->table('post');
        // Query to get posts of followed users, excluding the current user's posts

        // Query to get posts of the current user
        $builder->select('post.*, users.username')
                ->join('users', 'users.id = post.user_id')
                ->where('post.user_id', $currentUserId)  // Only get posts of the current user
                ->orderBy('post.created_at', 'DESC');
        $query = $builder->get();

        $data['posts'] = $query->getResultArray();
        $data['user'] =                $user = $UserProfilesModel->where('user_id', $currentUserId)->first();
---
SELECT `post`.*, `users`.`username`
FROM `post`
JOIN `users` ON `users`.`id` = `post`.`user_id`
WHERE `post`.`user_id` = '4'
ORDER BY `post`.`created_at` DESC
SELECT `users`.*
FROM `users`
WHERE `id` = '1'
SELECT `users`.*, `user_profiles`.`profile_picture`
FROM `users`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `users`.`id`
WHERE `users`.`id` = '4'
 LIMIT 1
SELECT *
FROM `user_profiles`
WHERE `user_id` = '4'
 LIMIT 1

    public function Profile_edit(){
        $session = session();
        $UserProfilesModel = new UserProfilesModel();
        $data['userid'] = $session->get('id');
        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }
        $db = \Config\Database::connect();
        $builder = $db->table('users');
        $builder->select('users.*');
        $builder->where('id',   $session->get('id'));
        $query = $builder->get();

        $data['users'] = $query->getResultArray();
        $data['user'] =                $user = $UserProfilesModel->where('user_id',  $data['userid'])->first();
---
SELECT `users`.*
FROM `users`
WHERE `id` = '6'
SELECT *
FROM `user_profiles`
WHERE `user_id` = '6'
 LIMIT 1