app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'musthafamajid@gmail.com'
OR `username` = 'musthafamajid@gmail.com'
 LIMIT 1
---
    public function login_user()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->orWhere('username', $email)->first();