app/Controllers/PostController.php

INSERT INTO `post` (`user_id`, `content`, `created_at`, `updated_at`) VALUES ('6', 'aSa', '2024-10-16 09:35:43', '2024-10-16 09:35:43')
---
                    'updated_at' => date('Y-m-d H:i:s'),
                ];

                $postModel->save($data);

INSERT INTO `likes` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('9', '4', '2024-10-24 12:27:42', '2024-10-24 12:27:42')
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `post_id` = '9'
---
    public function like()
    {
        $likeModel = new LikeModel();

        $postId = $this->request->getPost('post_id');
        $userId = session()->get('id');

        // Add like to database (pseudo code)
        $likeModel = new LikeModel();
        $likeModel->insert(['post_id' => $postId, 'user_id' => $userId]);

        // Return updated like count
        $likeCount = $likeModel->where('post_id', $postId)->countAllResults();

INSERT INTO `comments` (`post_id`, `user_id`, `content`, `created_at`, `updated_at`) VALUES ('8', '4', '6543re', '2024-10-25 10:21:27', '2024-10-25 10:21:27')
---
    public function comment()
    {
        $postId = $this->request->getPost('post_id');
        $userId = session()->get('id');
        $content = $this->request->getPost('content');

        // Add comment to database
        $commentModel = new CommentModel();
        $commentModel->insert([
            'post_id' => $postId,
            'user_id' => $userId,
            'content' => $content
        ]);