app/Controllers/UserController.php

    public function user_dashboard()
    {
        $session = session();
        $FollowersModel = new FollowersModel();
        $userModel = new UserModel();
        $UserProfilesModel = new UserProfilesModel();


        if (!$session->get('logged_in')) {
            return redirect()->to('/');
        }
        $data['activeUsers'] = $userModel->where('status', 'active')->findAll();
        $data['userid'] = $session->get('id');

        // Step 1: Get all users (you can adjust the limit as needed)
        $allUsers = $userModel->findAll();

        // Step 2: Get follower IDs

        $followerIds = $FollowersModel->where('followerId',   $data['userid'])
                                    ->findColumn('followedId');
---
SELECT *
FROM `users`
WHERE `status` = 'active'
SELECT *
FROM `users`
SELECT `followedId`
FROM `followers`
WHERE `followerId` = '4'

        // echo "<pre>";
        // print_r($data['posts']);
        // die();
        $data['user'] =     $user = $UserProfilesModel->where('user_id',  $data['userid'])->first();
---
SELECT *
FROM `user_profiles`
WHERE `user_id` = '4'
 LIMIT 1

    public function view_followers()
    {
        $session = session();
        $FollowersModel = new FollowersModel();
        $UserProfilesModel = new UserProfilesModel();

        $userid = $session->get('id');
        // Joining the followers table with the users table to get follower names
        $data['followers'] = $FollowersModel
        ->select('*')
        ->join('users', 'followers.followedId = users.id')
        ->join('user_profiles', 'users.id = user_profiles.user_id')

        ->where('followers.followerId', $userid)
        ->findAll();
        $data['user'] =     $user = $UserProfilesModel->where('user_id',  $userid)->first();
---
SELECT *
FROM `followers`
JOIN `users` ON `followers`.`followedId` = `users`.`id`
WHERE `followers`.`followerId` = '6'
SELECT *
FROM `user_profiles`
WHERE `user_id` = '6'
 LIMIT 1