app/Controllers/UserController.php

SELECT *
FROM `user_profiles`
WHERE `user_id` = '4'
 LIMIT 1
---
        $data['posts'] = $query->getResultArray();
        // print_r($data['posts']);
        // die();
        $data['user'] =     $user = $UserProfilesModel->where('user_id',  $data['userid'])->first();