app/Controllers/UserController.php

    public function active_users()
    {
        $userModel = new UserModel();

        // Assuming 'status' is used to indicate whether a user is active or not
        $activeUsers = $userModel->where('status', 'active')->findAll();
---
SELECT *
FROM `users`
WHERE `status` = 'active'

    public function view_followers()
    {
        $session = session();
        $FollowersModel = new FollowersModel();
        $userid = $session->get('id');
        // Joining the followers table with the users table to get follower names
        $followers = $FollowersModel
        ->select('*')
        ->join('users', 'followers.followedId = users.id')
        ->where('followers.followerId', $userid)
        ->findAll();
---
SELECT *
FROM `followers`
JOIN `users` ON `followers`.`followedId` = `users`.`id`
WHERE `followers`.`followerId` = '4'