app/Models/FollowRequestsModel.php

SELECT *
FROM `follow_requests`
WHERE `followerId` = '4'
AND `followedId` = '1'
AND `status` IN ('pending','accepted')
 LIMIT 1
INSERT INTO `follow_requests` (`followerId`, `followedId`, `status`, `createdAt`, `updatedAt`) VALUES ('4', '1', 'pending', '2024-11-10 08:35:40', '2024-11-10 08:35:40')
---
    public function sendFollowRequest($followerId, $followedId)
    {
        // Check if a request already exists
        $existingRequest = $this->where('followerId', $followerId)
                                ->where('followedId', $followedId)
                                ->whereIn('status', ['pending', 'accepted']) // Prevent duplicate requests
                                ->first();

        if ($existingRequest) {
            return false; // Request or follow relationship already exists
        }

        // Insert new follow request with pending status
        return $this->insert([
            'followerId' => $followerId,
            'followedId' => $followedId,
            'status'     => 'pending',
        ]) !== false;

SELECT `follow_requests`.*, `users`.`username`, `user_profiles`.`profile_picture`
FROM `follow_requests`
JOIN `users` ON `users`.`id` = `follow_requests`.`followerId`
JOIN `user_profiles` ON `user_profiles`.`user_id` = `follow_requests`.`followerId`
WHERE `follow_requests`.`followedId` = '4'
AND `follow_requests`.`status` = 'pending'
---
    public function getIncomingRequestsWithDetails($userId)
    {
        return $this->select('follow_requests.*, users.username, user_profiles.profile_picture')
                    ->join('users', 'users.id = follow_requests.followerId')
                    ->join('user_profiles', 'user_profiles.user_id = follow_requests.followerId')

                    ->where('follow_requests.followedId', $userId)
                    ->where('follow_requests.status', 'pending')
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `followers` AS `f1`
JOIN `followers` AS `f2` ON `f1`.`followerId` = `f2`.`followerId`
WHERE `f1`.`followedId` = '6'
AND `f2`.`followedId` = '4'
---
    public function getMutualFollowersCount($userId1, $userId2)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('followers AS f1')
                      ->join('followers AS f2', 'f1.followerId = f2.followerId')
                      ->where('f1.followedId', $userId1)
                      ->where('f2.followedId', $userId2);

        $mutualFollowers = $builder->countAllResults();