app/Models/FollowersModel.php

INSERT INTO `followers` (`followerId`, `followedId`, `followedAt`, `updated_at`) VALUES ('4', '6', '2024-11-05 11:20:09', '2024-11-05 11:20:09')
---
    public function followUser($followerId, $followedId)
    {
        return $this->insert([
            'followerId' => $followerId,
            'followedId' => $followedId,
            'followedAt' => date('Y-m-d H:i:s')
        ]);

SELECT *
FROM `followers`
WHERE `followerId` = '4'
AND `followedId` = '6'
 LIMIT 1
---
    public function unfollowUser($followerId, $followedId)
    {
        return $this->where('followerId', $followerId)
                    ->where('followedId', $followedId)
                    ->delete();