app/Models/LikeModel.php

    public function likeExists($postId, $userId)
    {
        return $this->where('post_id', $postId)->where('user_id', $userId)->first() !== null;
---
SELECT *
FROM `likes`
WHERE `post_id` = '8'
AND `user_id` = '4'
 LIMIT 1